# pandas Basics

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Dataframe
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[2,7,3,23],[3,6,8,23],[23,23,63,12]])

# Show Dataframe1
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3   3   6   8  23
4  23  23  63  12

In [4]:
# head function
df1.head()

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3   3   6   8  23
4  23  23  63  12

In [5]:
# show top 3
df1.head(3)

   0  1  2   3
0  1  2  3   4
1  5  6  7   8
2  2  7  3  23

In [6]:
# tail function
df1.tail()

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3   3   6   8  23
4  23  23  63  12

In [7]:
# show bottom 3
df1.tail(3)

    0   1   2   3
2   2   7   3  23
3   3   6   8  23
4  23  23  63  12

# Slicing and Adding Columns

In [8]:
# columns should always be equal to len of columns of DataFrame
df2 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[2,7,3,23],[3,6,8,23],[23,23,63,12]],columns=['A1', 'B2', 'C', 'D'])

In [9]:
df2

   A1  B2   C   D
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3   3   6   8  23
4  23  23  63  12

In [10]:
df2.shape

(5, 4)

In [11]:
# slicing
df1.iloc[0,1]

2

In [12]:
df1.iloc[0:2,0:2]

   0  1
0  1  2
1  5  6

# Reading a CSV File

In [13]:
df = pd.read_csv('stocks.csv')

In [14]:
df.head(5)

,SYMBOL,SERIES,DATE1,PREV_CLOSE,OPEN_PRICE,HIGH_PRICE,LOW_PRICE,LAST_PRICE,CLOSE_PRICE,AVG_PRICE,TTL_TRD_QNTY,TURNOVER_LACS,NO_OF_TRADES,DELIV_QTY,DELIV_PER
0,20MICRONS,EQ,03-Feb-2022,90.90,91.65,93.70,89.50,91.00,90.60,91.21,260677,237.76,4001,105320,40.40
1,21STCENMGM,EQ,03-Feb-2022,42.90,42.05,42.05,42.05,42.05,42.05,42.05,3341,1.40,47,3341,100.00
2,3IINFOLTD,EQ,03-Feb-2022,77.35,77.35,78.40,76.60,76.90,76.90,77.22,374402,289.11,4000,270957,72.37
3,3MINDIA,EQ,03-Feb-2022,24982.75,25221.50,25221.50,24520.80,24580.00,24868.65,24879.35,3570,888.19,2078,1882,52.72
4,3PLAND,BE,03-Feb-2022,18.70,19.00,19.60,19.00,19.60,19.60,19.55,4268,0.83,60,-,-

In [15]:
print(df['SYMBOL'].dtype)

object

# Writing a CSV File

In [16]:
df2 = pd.DataFrame([[1,3,4],[5,6,7,8],[2,7,3,23],[3,6,8,23],[23,23,63]],columns=['A', 'B', 'C', 'D'])
print(df2)

    A   B   C     D
0   1   3   4   NaN
1   5   6   7   8.0
2   2   7   3  23.0
3   3   6   8  23.0
4  23  23  63   NaN

In [17]:
df2.to_csv('export.csv')
df3 = pd.read_csv('export.csv')
df3

   Unnamed: 0   A   B   C     D
0           0   1   3   4   NaN
1           1   5   6   7   8.0
2           2   2   7   3  23.0
3           3   3   6   8  23.0
4           4  23  23  63   NaN

In [18]:
# indexing is False
df2.to_csv('export.csv',index=False)
df4 = pd.read_csv('export.csv')
df4

    A   B   C     D
0   1   3   4   NaN
1   5   6   7   8.0
2   2   7   3  23.0
3   3   6   8  23.0
4  23  23  63   NaN

# Merging DataFrames

In [19]:
df5 = pd.DataFrame([[1,2,3],[5,6,7],[2,7,3]], columns=['A','B','C'])
df5

   A  B  C
0  1  2  3
1  5  6  7
2  2  7  3

In [20]:
df6 = pd.DataFrame([[11,2,31],[22,8,35],[63,7,92]], columns=['X','Y','Z'])
df6

    X  Y   Z
0  11  2  31
1  22  8  35
2  63  7  92

In [21]:
# merge those rows & columns
# whose col-B of df5 has
# same value as of col-Y of df6
df7 = pd.merge(df5,df6,left_on='B',right_on='Y')
df7

   A  B  C   X  Y   Z
0  1  2  3  11  2  31
1  2  7  3  63  7  92